#include "MyPG.h"
#include "MyGameMain.h"

//エンディング
namespace Ending
{
	//ゲーム情報
	int					logoPosY;
	DG::Image::SP       img;

	//-----------------------------------------------------------------------------
	//初期化処理
	//機能概要：プログラム起動時に１回実行される（素材などの準備を行う）
	//-----------------------------------------------------------------------------
	void Initialize()
	{
		img = DG::Image::Create("./data/image/Ending.bmp");
		logoPosY = +270;
	}
	//-----------------------------------------------------------------------------
	//解放処理
	//機能概要：プログラム終了時に１回実行される（素材などの解放を行う）
	//-----------------------------------------------------------------------------
	void Finalize()
	{
		img.reset( );
	}
	//-----------------------------------------------------------------------------
	//更新処理
	//機能概要：ゲームの１フレームに当たる処理
	//-----------------------------------------------------------------------------
	TaskFlag UpDate()
	{
		auto inp = ge->in1->GetState();
		logoPosY -= 9;
		if (logoPosY  <  0) { logoPosY = 0; }

		TaskFlag rtv = TaskFlag::Ending;//取りあえず現在のタスクを指定
		if (logoPosY <= 0) {
			if (true == inp.ST.down) {
				rtv = TaskFlag::Title;	//次のタスクへ
			}
		}
		return rtv;
	}
	//-----------------------------------------------------------------------------
	//描画処理
	//機能概要：ゲームの１フレームに当たる表示処理
	//-----------------------------------------------------------------------------
	void Render()
	{
		ML::Box2D  draw(0, 0, 480, 270);
		draw.Offset(0, logoPosY);
		ML::Box2D  src(0, 0, 240, 135);

		img->Draw(draw, src);
	}
}